// معرفتش اكتب كله أنجليزي ولا كله عربي
// فحبيت أعبر مع اللي فهمت بالطريقة دي 



//   oop هي طريقه لتمثيل الأكواد داخل العديد من لغات البرمجة
//  بيتم تمثيلها عن طريق ال class
//  ال class  بيتكون من حاجتين أساسيتين Attributes and Methods
// Attributes ده عبارة عن مواصفات ال object  
// Methods ده عبارة عن الأدوار اللي ممكن يعملها ال object
// constructor ده عبارة عن دالة بيتم تنفيذها عند إنشاء كائن من ال class 
// بيتم من خلاله إعطاء قيم ابتدائيه للمتغيرات

// هناك نوع اخر من ال constructor  اسمه ال named constructor 

// class className{
// Attributes

// className(){  
//      //constructor
// }

// Methods

// }

// من أهم مبادئ ال opp  encapsulation 
// وهو عبارة عن تغليف الكلاس بتاعي بحيث لا يتم التعديل علي قيم المتغيرات إلا من خلال بعض القيوم 
//  خطوات العمل
// تحويل المتغيرات الي متغيرا خاصه 
// ثم عمل دوال  getter and setter  للمتغيرات بتعت  
//


